include("../impl/dihotomy_method.jl")

# Простой корень 2, но второй корень не попал в интервал
f(x) = x^2 - 4

dihotomy(f, 0, 3, 1e-5)

# Корень 1.5
f(x) = x^3 - x - 2

dihotomy(f, 1, 2, 1e-5)

# Корень 1 в интервале
f(x) = x^3 - 6x^2 + 11x - 6   # (x-1)(x-2)(x-3)

dihotomy(f, 0.5, 1.5, 1e-5)

#Корень вне интервала
f(x) = x^2 + 1

dihotomy(f, -2, 2, 1e-5)

# Корень на границе
f(x) = x - 3

dihotomy(f, 3, 5, 1e-5)

# Корень крайне некорректный
f(x) = x^2 - 2

dihotomy(f, 1.414, 1.415, 1e-8)

# +-  0.7
f(x) = cos(x) - x

dihotomy(f, 0, 1, 1e-10)